<template>
  <div class="about-education" id="about-education">
    <h2 class="about-education__title">Образование</h2>
    <div class="about-education__list">
      <div
        class="about-education__list-item"
        v-for="(item, i) in itemArray"
        :key="i"
      >
        <h4 class="about-education__item-year">
          {{ item?.year }}
        </h4>
        <div class="about-education__item-text">
          {{ item?.text }}
        </div>
      </div>
    </div>
    <div class="about-education__additional">
      <elements-collapse
        class="about-education__additional-collapse"
        title="Дополнительные специальности"
      >
        <ul class="about-education__additional-list">
          <li>— Врач интегративной медицины</li>
          <li>— Врач Аюрведы</li>
          <li>— Физиотерапия</li>
          <li>— Гирудотерапия</li>
          <li>— Тренер по методике гипнороды</li>
          <li>— Тренер подготовки к беременности и подготовки к родам</li>
          <li>— Бьюти-эксперт-гинеколог</li>
          <li>— Нутрициолог-гинеколог</li>
          <li>— Гинеколог-эндокринолог</li>
          <li>— Специалист по эстетической гинекологии</li>
        </ul>
      </elements-collapse>
      <elements-collapse
        class="about-education__additional-collapse"
        title="Повышение квалификации"
      >
        <ul class="about-education__additional-list">
          <li>
            — «Современные аспекты патогенеза, диагностики, лечения заболеваний
            молочных желез», Эндокринологический научный центр РАМН
          </li>
          <li>— «Климактерий и постменопауза», НЦАГ и П РАМН</li>
          <li>
            — «Медикаментозное прерывание беременности», ММА им. И. М. Сеченова
          </li>
          <li>
            — «Актуальные вопросы акушерства, оперативная гинекология и
            эндоскопия, консервативные методы лечения в гинекологии», ГОУ ВПО
            РГМУ
          </li>
          <li>— «Основные проблемы невынашивания беременности», РГМУ</li>
          <li>
            — «Клинические исследования лекарственных препаратов. Протоколы GMP»
          </li>
          <li>— «УЗИ в акушерстве и гинекологии»</li>
          <li>— «Эндоскопия в гинекологии»</li>
          <li>— «Патология шейки матки»</li>
        </ul>
      </elements-collapse>
      <elements-collapse
        class="about-education__additional-collapse"
        title="Регалии и научные достижения"
      >
        <ul class="about-education__additional-list">
          <li>— С 2002 член Ассоциации гинекологов – эндокринологов России</li>
          <li>— С 2004 член Ассоциации «Квантовая медицина»</li>
          <li>
            — 2005 – кандидат медицинских наук, ГОУ ВПО "РГМУ Федерального
            агентства по здравоохранению и социальному развитию" диплом №165931
            от 17.10.2005 г. Тема диссертации: «Роль молекулярных и генетических
            факторов тромбофилии в генезе неразвивающейся беременности и
            начавшегося выкидыша»
          </li>
          <li>— С 2007 член Российской ассоциации акушеров-гинекологов</li>
          <li>
            — 2014 – доктор медицинских наук, ГБОУ ВПО РНИМУ им. Н.И.Пирогова
            Минздрава России. Диплом ДДН №027426. Тема диссертации:
            «Беременность высокого риска по развитию акушерской патологии -
            система гемостаза и функция эндотелия. Системный подход к
            диагностике и терапии»
          </li>
          <li>— 2014 – врач высшей квалификационной категории</li>
          <li>
            — С 2014 член международного общества гинекологов-эндокринологов, и
            общества по изучению проблем гемостаза в акушерстве и гинекологии
          </li>
          <li>
            — 2015 – MD (Medicinae Doctor), Professor International Category
            Research
          </li>
          <li>
            — Автор более 300 научных статей и 9 монографий и практических
            руководств
          </li>
          <li>
            — Многократный участник международных и российских медицинских
            конференций и клинических исследований
          </li>
        </ul>
      </elements-collapse>
      <elements-collapse
        class="about-education__additional-collapse"
        title="Научные книги"
      >
        <ul class="about-education__additional-list">
          <li>
            — Доброхотова Ю.Э., Джобава Э.М., Себко Т.В. и др.Сахарный диабет и
            беременность. Сборник клинических лекций «Актуальные вопросы
            невынашивания беременности». ООО «Адамант», 2007
          </li>
          <li>
            — Доброхотова Ю.Э., Джобава Э.М., Иванова Т.А. Эпилепсия и
            беременность. Сборник клинических лекций «Актуальные вопросы
            невынашивания беременности». ООО «Адамант», 2007
          </li>
          <li>
            — Доброхотова Ю.Э., Джобава Э.М., Ли А.Д. Ведение беременности и
            родов у пациенток с тромботическими осложнениями. Сборник
            клинических лекций «Актуальные вопросы невынашивания беременности».
            ООО «Адамант», 2007
          </li>
          <li>
            — Доброхотова Ю. Э., Джобава Э.М., Рагимова З.Э., Герасимович М.Ю.
            Руководство «Синдром гиперандрогении в практике акушера-гинеколога,
            дерматолога и эндокринолога». ГЭОТАР-Медиа, 2009
          </li>
          <li>
            — Доброхотова Ю.Э., Джобава Э.М., Озерова Р.И. «Неразвивающаяся
            беременность». ГЭОТАР-Медиа, 2010
          </li>
          <li>
            — Доброхотова Ю.Э., Щеголев А.А., Джобава Э.М. и др. «Тромботические
            состояния в акушерской практике», ГЭОТАР-Медиа, 2010
          </li>
          <li>
            — Доброхотова Ю.Э., Джобава Э.М. Учебно-методическое пособие
            «Плацентарная недостаточность. Современная терапия. Особенности
            течения плацентарной недостаточности при варикозной болезни». ООО
            «Издательство Адамант», 2011
          </li>
          <li>
            — Гришин И.И., Джобава Э.М., Литвинова Н.А., Ибрагимова Д.М.
            Практическое руководство «Эмболизация маточных артерий в практике
            акушера-гинеколога». ЛитТерра, 2011
          </li>
          <li>
            — Доброхотова Ю.Э., Джобава Э.М. Учебно-методическое пособие
            «Плацентарная недостаточность. Современная терапия. Особенности
            течения плацентарной недостаточности при варикозной болезни». ООО
            «Издательство Адамант», 2011
          </li>
          <li>
            — Джобава Э.М., Доброхотова Ю.Э. «Дисфункция эндотелия и система
            гемостаза у беременных из групп высокого риска. Системный подход к
            диагностике и терапии. Клинические рекомендации». ООО «Телер», 2013
          </li>
          <li>
            — Джобава Э.М. Доброхотова Ю.Э. «Дисфункция эндотелия и система
            гемостаза у беременных из групп высокого риска. Системный подход к
            диагностике и терапии. Клинические рекомендации». ООО «Телер», 2013.
          </li>
          <li>
            — Близнец Е.А, Викторова Е.А., Вишнева Е.А., Джобава Э.М., Ильина
            Н.И, Кузьменко Н.Б, Латышева Е.А., Латышева Т.В., Манто И.А.,
            Намазова-Баранова Л.С., Ненашева Н.М., Пампура А.Н., Поляков А.В.,
            Селимзянова Л.Р., Щербина А.Ю. «Наследственный ангиоотек.
            Клинические рекомендации (D84.1)», 2021 год
          </li>
        </ul>
      </elements-collapse>
    </div>
  </div>
</template>

<script>
const itemArray = [
  {
    year: "2001",
    text: "Российский национальный исследовательский медицинский университет имени Н.И. Пирогова (лечебное дело)",
  },
  {
    year: "2003",
    text: "Российский национальный исследовательский медицинский университет имени Н.И. Пирогова (акушерство и гинекология). Ординатура",
  },
  {
    year: "2008",
    text: "Российский национальный исследовательский медицинский университет имени Н.И. Пирогова (ультразвуковая диагностика). Циклы переподготовки",
  },
  {
    year: "2013",
    text: "Российский национальный исследовательский медицинский университет имени Н.И. Пирогова (акушерство и гинекология). Повышение квалификации",
  },
  {
    year: "2013",
    text: "Российский национальный исследовательский медицинский университет имени Н.И. Пирогова (ультразвуковая диагностика). Повышение квалификации",
  },
  {
    year: "2018",
    text: "Российский национальный исследовательский медицинский университет имени Н.И. Пирогова (акушерство и гинекология). Повышение квалификации",
  },
];

export default {
  setup() {
    return {
      itemArray,
    };
  },
};
</script>

<style lang="scss" scoped>
.about-education {
  width: 100%;

  &__title {
    font-size: 38px;
    color: #644c5c;
    margin: 0 0 40px 0;

    @media screen and (max-width: 1200px) {
      font-size: 36px;
    }

    @media screen and (max-width: 680px) {
      font-size: 30px;
    }
  }

  &__list {
    display: grid;
    grid-template-columns: 1fr 1fr;
    grid-gap: 40px;

    @media screen and (max-width: 1200px) {
      grid-template-columns: 1fr;
      grid-gap: 20px;
    }
  }

  &__list-item {
    background: #ece7e1;
    border-radius: 15px;
    padding: 40px;

    @media screen and (max-width: 680px) {
      padding: 30px;
    }
  }

  &__item-year {
    margin: 0 0 15px 0;
    color: #78353e;
    font-size: 22px;
  }

  &__item-text {
    color: #232323;
    font-size: 16px;
    line-height: 150%;

    @media screen and (max-width: 680px) {
      font-size: 15px;
    }
  }

  &__additional {
    margin: 100px 0 0 0;
  }

  &__additional-list {
    list-style: none;
    padding: 0;
    margin: 0;
    color: #232323;
    font-size: 16px;
    max-width: 70%;

    @media screen and (max-width: 1200px) {
      max-width: 100%;
    }

    li {
      &:not(:last-child) {
        margin: 0 0 5px 0;
      }
    }
  }

  &__additional-collapse {
    &:not(:last-child) {
      margin: 0 0 15px 0;
    }
  }
}
</style>
