<template>
  <div class="school-program">
    <h2 class="school-program__title" id="school-program__title">Программа</h2>
    <elements-collapse
      v-for="(item, i) in tabs"
      :key="i"
      class="school-program__required-collapse"
      :title="item.title"
    >
      <ul class="school-program__required-list">
        <li v-for="(element, ind) in item?.items" :key="ind">{{ element }}</li>
      </ul>
    </elements-collapse>
  </div>
</template>

<script>
const tabs = [
  {
    title: "Блок 1. 1 триместр (1-12 неделя)",
    items: [
      "— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом",
      "— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом",
      "— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом",
      "— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом",
      "— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности",
      "— Урок йоги. Йога в период беременности",
      "— Урок гинеколога и стилиста. Что носить беременным?",
    ],
  },
  {
    title: "Блок 2. 2 триместр (13-24 неделя)",
    items: [
      "— Урок гинеколога. Особенности 2 триместра",
      "— Урок врача аюрведы. Аюрведа во 2 триместре беременности",
    ],
  },
  {
    title: "Блок 3. 3 триместр (24-40 неделя)",
    items: [
      "— Урок гинеколога. Особенности 3 триместра",
      "— Урок врача аюрведы. Аюрведа в 3 триместре беременности",
      "— Урок остеопата. Мягкие техники и остеопатия в 3 триместре и при подготовке к родам",
    ],
  },
  {
    title: "Блок 4. Подготовка к родам",
    items: [
      "— Урок гинеколога. Подготовка к родам",
      "— Урок психолога. Гипнороды",
      "— Урок доулы. Психологическая помощь в родах. Фишки и лайфхаки мягких родов",
    ],
  },
  {
    title: "Блок 5. Послеродовый период",
    items: [
      "— Урок гинеколога. Особенности послеродового периода",
      "— Урок педиатра. Медицинские аспекты раннего постнатального периода",
      "— Урок врача остеопата. Мягкие техники и остеопатия мамы и малыша в послеродовом периоде",
      "— Урок врача аюрведы. Аюрведа в послеродовом периоде",
      "— Урок преподавателя йоги. Йога в послеродовом периоде",
      "— Урок доулы. Принципы послеродового восстановления",
      "— Урок доулы. Грудное вскармливание. Все о поддержке",
      "— Урок доулы. Первые дни с малышом. Вебинар молодого бойца",
      "— Урок доулы. Жизнь с малышом. Минимум затрат при максимуме пользы",
      "— Урок детского психолога. Особенности детской психологии в раннем возрасте",
      "— Урок стилиста. Гардероб мамы в декрете",
      "— Урок гинеколога. Заключительное слово",
      "— Урок остеопата. Гаджеты для детей и новорожденных",
    ],
  },
  {
    title: "Блок 6. Бонусы",
    items: [
      "Дополнительные материалы:",
      "— Рецепт масла для промежности для профилактики разрывов в родах, pdf-файл",
      "— Список вещей в роддом, pdf-файл",
      "— Памятка «Создание атмосферы в родах», pdf-файл",
      "— План родов, pdf-файл",
      "— Памятка «Позы в родах», pdf-файл",
      "— Список книг о беременности, pdf-файл",
      "— Список фильмов о беременности, pdf-файл",
      "— Упражнения для беременных от остеопата, pdf-файл",
      "— Рецепты чаев в роды и послеродовый период для скорейшего восстановления, pdf-файл",
      "— Памятка по массажу для партнера на роды, pdf-файл",
      "— Методика самоосмотра груди, pdf-файл",
      "— Чек-лист «15 вопросов акушеру-гинекологу перед родами», pdf-файл",
      "— Программа «Плоский животик после родов/КС», pdf-файл",
      "— Чек-лист «Биострахование малыша», pdf-файл",
      "ㅤ",
      "Подарочные материалы:",
      "— Вебинар «Анализы и обследования во время беременности»",
      "— Вебинар «Углеводные нарушения и беременность»",
      "— Методичка «Острые респираторные заболевания и беременность», pdf-файл",
      "— Гайд по питанию беременных, расширенный pdf-файл",
      "— Книга рецептов для беременных, pdf-файл",
      "— Авторская программа восстановления после родов, pdf-файл",
      "— Программа «Плоский животик после родов/КС»",
    ],
  },
];

export default {
  setup() {
    return {
      tabs,
    };
  },
};
</script>

<style lang="scss" scoped>
.school-program {
  width: 100%;

  &__title {
    font-size: 38px;
    color: #644c5c;
    margin: 0 0 40px 0;

    @media screen and (max-width: 1200px) {
      font-size: 36px;
    }

    @media screen and (max-width: 680px) {
      font-size: 30px;
    }
  }

  &__required-collapse {
    &:not(:last-child) {
      margin: 0 0 15px 0;
    }
  }

  &__required-list {
    list-style: none;
    padding: 0;
    margin: 0;
    color: #232323;
    font-size: 16px;
    max-width: 70%;

    @media screen and (max-width: 1200px) {
      max-width: 100%;
    }

    li {
      &:not(:last-child) {
        margin: 0 0 5px 0;
      }
    }
  }
}
</style>
